package com.example.admin.musicplayer;

import android.app.Application;
import android.test.ApplicationTestCase;
import android.text.Html;
import android.util.Log;

import com.example.admin.musicplayer.utils.L;

/**
 * <a href="http://d.android.com/tools/testing/testing_android.html">Testing Fundamentals</a>
 */
public class ApplicationTest extends ApplicationTestCase<Application> {
    public ApplicationTest() {
        super(Application.class);
    }

    public void testLyric() {
        String s = Html.fromHtml("[ti&#58;04爸爸媽媽&#32;Mama&#32;&#38;&#32;Papa&#95;mmm&#95;Pf]&#10;" +
                "[ar&#58;李荣浩]&#10;[al&#58;]&#10;[by&#58;]&#10;[offset&#58;0]&#10;[00&#58;00&#46;" +
                "87]爸爸妈妈&#32;&#45;&#32;李荣浩&#10;[00&#58;01&#46;68]词：李荣浩&#10;[00&#58;02&#46;" +
                "74]曲：李荣浩&#10;[00&#58;03&#46;99]&#10;[00&#58;20&#46;20]我曾经很想知道&#10;[00&#58;" +
                "22&#46;88]&#10;[00&#58;23&#46;39]同样的话要说多少次才好&#10;[00&#58;27&#46;95]&#10;[00&#58;" +
                "28&#46;89]那些再三强调的老套&#10;[00&#58;32&#46;29]&#10;[00&#58;32&#46;" +
                "80]长大了才知道是不是需要&#10;[00&#58;37&#46;56]&#10;[00&#58;38&#46;31]很少主动拥抱&#10;[00&#58;" +
                "41&#46;05]就算为了自豪&#10;[00&#58;43&#46;64]腼腆的笑&#10;[00&#58;45&#46;71]要强而又低调&#10;" +
                "[00&#58;48&#46;32]穿的布料&#10;[00&#58;50&#46;38]我赠送的外套&#10;[00&#58;53&#46;" +
                "07]过时也不丢掉&#10;[00&#58;56&#46;03]&#10;[00&#58;57&#46;77]还是一样&#10;[00&#58;59&#46;" +
                "82]太多理所应当让人觉得平常&#10;[01&#58;05&#46;55]&#10;[01&#58;06&#46;59]不算太小的房&#10;[01&#58;" +
                "09&#46;16]冬暖夏凉的那间放着我的床&#10;[01&#58;14&#46;94]&#10;[01&#58;15&#46;91]歌颂这种平凡&#32;" +
                "一两句唱不完&#10;[01&#58;21&#46;18]恩重如山&#32;听起来不自然&#10;[01&#58;25&#46;93]回头去看&#10;" +
                "[01&#58;27&#46;98]这是说了谢谢&#10;[01&#58;29&#46;99]反而才亏欠的情感&#10;[01&#58;33&#46;" +
                "99]&#10;[01&#58;35&#46;37]爸爸妈妈给我的不少不多&#10;[01&#58;39&#46;34]足够我在这年代奔波&#10;" +
                "[01&#58;42&#46;16]足够我生活&#10;[01&#58;43&#46;90]年少的轻狂不能用来挥霍&#10;[01&#58;48&#46;" +
                "64]也曾像朋友一样和我诉说&#10;[01&#58;52&#46;73]&#10;[01&#58;54&#46;07]爸爸妈妈总说经历的坎坷&#10;" +
                "[01&#58;57&#46;98]是度过青春的快乐&#10;[02&#58;02&#46;69]这时候这个季节&#10;[02&#58;04&#46;" +
                "91]又想起了这首歌&#10;[02&#58;09&#46;92]&#10;[02&#58;27&#46;18]还是一样&#10;[02&#58;29&#46;" +
                "30]太多理所应当让人觉得平常&#10;[02&#58;35&#46;14]&#10;[02&#58;35&#46;96]不算太小的房&#10;[02&#58;" +
                "38&#46;56]冬暖夏凉的那间放着我的床&#10;[02&#58;44&#46;44]&#10;[02&#58;45&#46;31]歌颂这种平凡&#32;" +
                "一两句唱不完&#10;[02&#58;50&#46;59]恩重如山&#32;听起来不自然&#10;[02&#58;55&#46;21]回头去看&#10;" +
                "[02&#58;57&#46;33]这是说了谢谢&#10;[02&#58;59&#46;54]反而才亏欠的情感&#10;[03&#58;03&#46;" +
                "10]&#10;[03&#58;04&#46;75]爸爸妈妈给我的不少不多&#10;[03&#58;08&#46;54]足够我在这年代奔波&#10;" +
                "[03&#58;11&#46;47]足够我生活&#10;[03&#58;13&#46;38]年少的轻狂不能用来挥霍&#10;[03&#58;17&#46;" +
                "94]也曾像朋友一样和我诉说&#10;[03&#58;21&#46;98]&#10;[03&#58;23&#46;48]爸爸妈妈总说经历的坎坷&#10;" +
                "[03&#58;27&#46;36]是度过青春的快乐&#10;[03&#58;31&#46;38]&#10;[03&#58;32&#46;" +
                "09]这时候这个季节&#10;[03&#58;34&#46;38]又想起了这首歌&#10;[03&#58;39&#46;37]&#10;[03&#58;" +
                "42&#46;33]爸爸妈妈给我的不少不多&#10;[03&#58;46&#46;14]足够我在这年代奔波&#10;[03&#58;49&#46;" +
                "18]足够我生活&#10;[03&#58;50&#46;95]年少的轻狂不能用来挥霍&#10;[03&#58;55&#46;" +
                "69]也曾像朋友一样和我诉说&#10;[04&#58;00&#46;42]&#10;[04&#58;01&#46;29]爸爸妈妈总说经历的坎坷&#10;" +
                "[04&#58;05&#46;02]是度过青春的快乐&#10;[04&#58;10&#46;55]&#10;[04&#58;12&#46;" +
                "10]这时候这个季节&#10;[04&#58;14&#46;38]又想起了这首歌\",\n" +
                "        ").toString();
        Log.i("test", s);
    }

    public void testNewLineLyric(){
        String lyric="[ti&#58;04爸爸媽媽&#32;Mama&#32;&#38;&#32;Papa&#95;mmm&#95;Pf]&#10;" +
                "[ar&#58;李荣浩]&#10;[al&#58;]&#10;[by&#58;]&#10;[offset&#58;0]&#10;[00&#58;00&#46;" +
                "87]爸爸妈妈&#32;";
        lyric= Html.fromHtml(lyric).toString();
        lyric= lyric.substring(lyric.indexOf("[00"));
        char[] chars = lyric.toCharArray();
        StringBuilder sb = new StringBuilder();
        int length = chars.length;
        for(int i=0;i<length;i++){
            if(i!=0 && chars[i]=='['){
                if(chars[i-1]!=']')
                sb.append("\r\n[");
            }else{
                sb.append(chars[i]);
            }
        }
        L.i("换行后:",sb.toString());
    }

    public void testSplit(){
        String str="[ss]";
        String[] split = str.split("]");
        Log.i("split",split.length+"");
    }


}